In [88]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [89]:
bankfull=pd.read_csv("/Users/Yesh/Desktop/ML/Datasets BITS/bank-full.csv")

In [90]:
bankfull.shape

(45211, 17)

In [91]:
bankfull.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [92]:
bankfull.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

In [93]:
bankfull.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

In [94]:
bankfull.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [95]:
(bankfull.isnull().sum().sort_values(ascending=False))

y            0
loan         0
job          0
marital      0
education    0
default      0
balance      0
housing      0
contact      0
poutcome     0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
age          0
dtype: int64

In [96]:
# Cross Tab education and y

In [97]:
pd.crosstab(bankfull.y,bankfull.education)

education  primary  secondary  tertiary  unknown
y
no            6260      20752     11305     1605
yes            591       2450      1996      252

In [98]:
#chi - square test

In [99]:
from scipy import stats as st

In [100]:
st.chi2_contingency(pd.crosstab(bankfull.y,bankfull.education))

(238.92350616407606,
 1.6266562124072994e-51,
 3,
 array([[ 6049.5371038 , 20487.71856407, 11744.98511424,  1639.75921789],
        [  801.4628962 ,  2714.28143593,  1556.01488576,   217.24078211]]))

In [20]:
yes = bankfull[bankfull.y =="yes"] #subsetting
no = bankfull[bankfull.y =="no"]

In [21]:
st.ttest_ind(yes.age, no.age) #independent T test

Ttest_indResult(statistic=5.350255423036203, pvalue=8.825643691922395e-08)

In [22]:
# Classification Algs

In [23]:
objectcols = bankfull.select_dtypes(include = ["object"])
numericcols = bankfull.select_dtypes(include = ["int64"])

In [ ]:
y

In [32]:
objectcols1 = objectcols.drop('month', axis = 1) #Dropping month
numericcols1 = numericcols.drop('day', axis = 1) # Dropping daymont

In [33]:
from sklearn.preprocessing import LabelEncoder

In [34]:
le = LabelEncoder()

In [35]:
objectcols2 = objectcols1.apply(le.fit_transform)

In [36]:
bankfulldf = pd.concat([numericcols1,objectcols2],axis =1 )

In [37]:
bankfulldf.head()

,age,balance,day,duration,campaign,pdays,previous,job,marital,education,default,housing,loan,contact,poutcome,y
0,58,2143,5,261,1,-1,0,4,1,2,0,1,0,2,3,0
1,44,29,5,151,1,-1,0,9,2,1,0,1,0,2,3,0
2,33,2,5,76,1,-1,0,2,1,1,0,1,1,2,3,0
3,47,1506,5,92,1,-1,0,1,1,3,0,1,0,2,3,0
4,33,1,5,198,1,-1,0,11,2,3,0,0,0,2,3,0

In [ ]:
#LogisticRegression

In [41]:
from sklearn.linear_model import LogisticRegression

In [42]:
y = bankfulldf.y
X = bankfulldf.drop("y",axis =1)

In [43]:
LogReg = LogisticRegression()

In [44]:
LogRegModel = LogReg.fit(X,y)

In [45]:
LogRegModel.score(X,y)

0.8910663334144345

In [46]:
LogRegpredict = LogRegModel.predict(X)

In [47]:
pd.crosstab(bankfulldf.y,LogRegpredict)

col_0      0     1
y
0      39150   772
1       4153  1136

In [48]:
#DecisionTreeClassifier

In [49]:
from sklearn.tree import DecisionTreeClassifier

In [50]:
DecTree = DecisionTreeClassifier()

In [51]:
DecTreemodel = DecTree.fit(X,y)

In [52]:
DecTreemodel.score(X,y)

1.0

In [53]:
DecTreepredict = DecTreemodel.predict(X)

In [54]:
pd.crosstab(bankfulldf.y,DecTreepredict)

col_0      0     1
y
0      39922     0
1          0  5289

In [56]:
#RandomForestClassifier

In [55]:
from sklearn.ensemble import RandomForestClassifier

In [57]:
RF = RandomForestClassifier(n_estimators=1000)

In [58]:
RFmodel = RF.fit(X,y)

In [59]:
RFmodel.score(X,y)

1.0

In [60]:
RFpredict = RFmodel.predict(X)

In [61]:
pd.crosstab(bankfulldf.y,RFpredict)

col_0      0     1
y
0      39922     0
1          0  5289

In [ ]:
#GradientBoosting

In [62]:
from sklearn.ensemble import GradientBoostingClassifier

In [66]:
GB = GradientBoostingClassifier(n_estimators=1000)

In [67]:
GBmodel = GB.fit(X,y)

In [68]:
GBmodel.score(X,y)

0.9281369578199996

In [69]:
GBpredict = GBmodel.predict(X)

In [71]:
pd.crosstab(bankfulldf.y,GBpredict)

col_0      0     1
y
0      39222   700
1       2549  2740

In [72]:
#Neural Network

In [73]:
from sklearn.neural_network import MLPClassifier

In [83]:
NN = MLPClassifier(activation='relu',hidden_layer_sizes=(10,))

In [84]:
NNmodel = NN.fit(X,y)

In [85]:
NNmodel.score(X,y)

0.8854924686470107

In [86]:
NNpredict = NNmodel.predict(X)

In [87]:
pd.crosstab(bankfulldf.y,NNpredict)

col_0      0    1
y
0      39650  272
1       4905  384